{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_10", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_10_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "dtype": "float32", "batch_input_shape": [1, null], "input_dim": 65, "output_dim": 128, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "GRU", "config": {"name": "gru_10", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "units": 384, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 65, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_10/kernel", "shape": [384, 65], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7631742935554654, "scale": 0.00615463139964085, "original_dtype": "float32"}}, {"name": "dense_10/bias", "shape": [65], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09238307090366589, "scale": 0.0006460354608647964, "original_dtype": "float32"}}, {"name": "embedding_10/embeddings", "shape": [65, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8481235420002657, "scale": 0.007439680192984787, "original_dtype": "float32"}}, {"name": "gru_10/gru_cell/kernel", "shape": [128, 1152], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.061148204055487, "scale": 0.009646801855049882, "original_dtype": "float32"}}, {"name": "gru_10/gru_cell/recurrent_kernel", "shape": [384, 1152], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7217064876182406, "scale": 0.006386783076267616, "original_dtype": "float32"}}, {"name": "gru_10/gru_cell/bias", "shape": [1152], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3386672478096158, "scale": 0.0020401641434314205, "original_dtype": "float32"}}]}]}